Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: The C<goto-EXPR> form expects a label name, whose scope will be resolved dynamically.
es_es: La forma C<goto>-EXPR espera un nombre de etiqueta, cuyo ámbito será resuelto dinámicamente.

source: This allows for computed C<goto>s per FORTRAN, but isn't necessarily recommended if you're optimizing for maintainability:
es_es: Esto permite crear C<goto> calculados como en FORTRAN, pero no está necesariamente recomendado si usted está optimizando durante el mantenimiento:

source: The C<goto-&NAME> form is quite different from the other forms of C<goto>.
es_es: La forma C<goto-&NOMBRE> es muy diferente de las otras formas de C<goto>.

source: In fact, it isn't a goto in the normal sense at all, and doesn't have the stigma associated with other gotos.
es_es: De hecho, no es un goto en el sentido normal y no tiene el estigma asociado con los otros gotos.

source: Instead, it exits the current subroutine (losing any changes set by local()) and immediately calls in its place the named subroutine using the current value of @_.
es_es: En cambio, sale de la subrutina actual (perdiendo cualquier cambio hecho por local()) e inmediatamente llama a la subrutina indicada pasandole el valor actual de @_.

source: This is used by C<AUTOLOAD> subroutines that wish to load another subroutine and then pretend that the other subroutine had been called in the first place (except that any modifications to C<@_> in the current subroutine are propagated to the other subroutine.) After the C<goto>, not even C<caller> will be able to tell that this routine was called first.
es_es: Esto se usa por subrutinas C<AUTOLOAD()> que desean cargar otra subrutina y fingen que ésta otra subrutina ha sido llamada en primer lugar (excepto que cualquier modificación a C<@_> en la subrutina actual se propaga a la otra). Después del C<goto>, ni siquiera C<caller()> será capaz de decir qué rutina fue llamada en primer lugar.

source: NAME needn't be the name of a subroutine; it can be a scalar variable containing a code reference, or a block that evaluates to a code reference.
es_es: NOMBRE no necesita ser el nombre de la subrutina; puede ser una variable escalar conteniendo una referencia a un código, o un bloque que evalúa a una referencia de código.

source: =item grep BLOCK LIST X<grep>
es_es: =item grep BLOQUE LISTA X<grep>

source: =item grep EXPR,LIST
es_es: =item grep EXPR,LISTA

source: This is similar in spirit to, but not the same as, grep(1) and its relatives.
es_es: Es similar en espíritu, pero no lo mismo, que con grep(1) y sus hermanos.

source: In particular, it is not limited to using regular expressions.
es_es: En particular, no está limitado a usar expresiones regulares.

source: Evaluates the BLOCK or EXPR for each element of LIST (locally setting C<$_> to each element) and returns the list value consisting of those elements for which the expression evaluated to true.
es_es: Evalúa el BLOQUE o EXPRE para cada elemento de LISTA (poniendo localmente C<$_> a cada elemento) y devuelve un valor de lista consistente en los elementos por los que la expresión evaluada es verdadera.

source: In scalar context, returns the number of times the expression was true.
es_es: En contexto escalar, devuelve el número de veces que la expresión fue verdadera.

source: @foo = grep(!/^#/, @bar); # weed out comments
es_es: @foo = grep(!/^#/, @bar); # quitar los comentarios

source: or equivalently,
es_es: o equivalentemente,

source: @foo = grep {!/^#/} @bar; # weed out comments
es_es: @foo = grep {!/^#/} @bar; # quitar los comentarios

source: Note that C<$_> is an alias to the list value, so it can be used to modify the elements of the LIST.
es_es: Note que C<$_> es un alias al valor de la lista, por lo que puede ser usado para modificar los elementos de la LISTA.

source: While this is useful and supported, it can cause bizarre results if the elements of LIST are not variables.
es_es: Mientras que esto suele ser útil, puede causar resultados extraños si los elementos de la LISTA no son variables.

source: Similarly, grep returns aliases into the original list, much as a for loop's index variable aliases the list elements.
es_es: Semejantemente, grep devuelve alias de la lista original, como los alias de los elementos de la lista de las variables de los bucles for.

source: That is, modifying an element of a list returned by grep (for example, in a C<foreach>, C<map> or another C<grep>) actually modifies the element in the original list.
es_es: Es decir, modificar un elemento de la lista devuelto por grep (por ejemplo, en un C<foreach>, C<map> u otro C<grep>) modifica el elemento en la lista original.

source: This is usually something to be avoided when writing clear code.
es_es: Esto es algo usualmente a ser evitado cuando se está escribiendo código claro.

source: See also L</map> for a list composed of the results of the BLOCK or EXPR.
es_es: Ver también L</map> para una lista compuesta de los resultados del BLOQUE o EXPR.

source: Interprets EXPR as a hex string and returns the corresponding value.
es_es: Interpreta EXPR como una cadena en hexadecimal y devuelve el valor correspondiente.

source: (To convert strings that might start with either C<0>, C<0x>, or C<0b>, see L</oct>.) If EXPR is omitted, uses C<$_>.
es_es: (Para convertir strings que pueden comenzar con C<0>, C<0x> o C<0b>, ver L</oct>.) Si se omite EXPR, usa C<$_>.

source: print hex '0xAf'; # prints '175'
es_es: print hex '0xAf'; # imprime '175'

source: print hex 'aF'; # same
es_es: print hex 'aF'; # lo mismo

source: Hex strings may only represent integers.
es_es: Strings hexadecimales sólo pueden representar enteros.

source: Strings that would cause integer overflow trigger a warning.
es_es: Strings que podrían causar desbordamiento de enteros lanzará un aviso.

source: Leading whitespace is not stripped, unlike oct().
es_es: Espacios en blanco aledaños, no son eliminados, a diferencia de oct().

source: To present something as hex, look into L</printf>, L</sprintf>, or L</unpack>.
es_es: Para presentar algo como hex, mire en L</printf>, L</sprintf> o L</unpack>.

source: =item import LIST X<import>
es_es: =item import LISTA X<import>

source: There is no builtin C<import> function.
es_es: No existe la función C<import>.

source: It is just an ordinary method (subroutine) defined (or inherited) by modules that wish to export names to another module.
es_es: Es sólo un método (subrutina) ordinario definido (o heredado) por módulos que desean exportar nombres a otro módulo.

source: The C<use> function calls the C<import> method for the package used.
es_es: La función C<use> llama al método C<import> del paquete a usar.

source: See also L</use>, L<perlmod>, and L<Exporter>.
es_es: Ver también L</use>, L<perlmod> y L<Exporter>.

source: =item index STR,SUBSTR,POSITION X<index> X<indexOf> X<InStr>
es_es: =item index STRING,SUBSTR,POSICIÓN X<index> X<índice> X<InStr>

source: =item index STR,SUBSTR
es_es: =item index STRING,SUBSTR

source: The index function searches for one string within another, but without the wildcard-like behavior of a full regular-expression pattern match.
es_es: La función index busca por un string dentro de otro, pero sin tener el comportamiento de un sistema de coincidencias basado en expresiones regulares.

source: It returns the position of the first occurrence of SUBSTR in STR at or after POSITION.
es_es: Devuelve la posición de la primera ocurrencia de SUBSTR en STRING en o después de POSICIÓN.

source: If POSITION is omitted, starts searching from the beginning of the string.
es_es: Si se omite POSICIÓN, comienza a buscar desde el comienzo del string.

source: POSITION before the beginning of the string or after its end is treated as if it were the beginning or the end, respectively.
es_es: POSICIÓN antes del comienzo del string o después de su final es tratado como si estuviera al principio o al final, respectivamente.

source: POSITION and the return value are based at C<0> (or whatever you've set the C<$[> variable to--but don't do that).
es_es: POSICIÓN y el valor devuelto están basados en C<0> (o al valor indicado por la variable C<$[>, pero no lo haga, por favor).

source: If the substring is not found, C<index> returns one less than the base, ordinarily C<-1>.
es_es: Si el substring no se encuentra, C<index> devuelve uno menos que la base, normalmente C<-1>.

source: =item int EXPR X<int> X<integer> X<truncate> X<trunc>
es_es: =item int EXPR X<int> X<entero> X<truncado> X<truncar>

source: Returns the integer portion of EXPR.
es_es: Devuelve la parte entera de EXPR.

source: If EXPR is omitted, uses C<$_>.
es_es: Si se omite EXPR, se usa C<$_>.

source: You should not use this function for rounding: one because it truncates towards C<0>, and two because machine representations of floating point numbers can sometimes produce counterintuitive results.
es_es: No debe usar esta función para redondear: primero, porque trunca hacia C<0> y segundo, porque las representaciones máquina de números en punto flotante puede producir, algunas veces, resultados dispares.

source: For example, C<int(-6.725/0.025)> produces -268 rather than the correct -269; that's because it's really more like -268.99999999999994315658 instead.
es_es: Por ejemplo, C<int(-6.725/0.025)> produce -268 en vez del valor correcto -269; esto es porque el valor realmente es -268.99999999999994315658.

source: Usually, the C<sprintf>, C<printf>, or the C<POSIX::floor> and C<POSIX::ceil> functions will serve you better than will int().
es_es: Usualmente, las funciones C<sprintf>, C<printf>, o C<POSIX::floor> y C<POSIX::ceil> le servirán mejor que int().

source: =item ioctl FILEHANDLE,FUNCTION,SCALAR X<ioctl>
es_es: =item ioctl MANEJADOR,FUNCIÓN,ESCALAR X<ioctl>

source: Implements the ioctl(2) function.
es_es: Implementa la función ioctl(2).

source: You'll probably first have to say
es_es: Probablemente primero querrá escribir

source: require "sys/ioctl.ph"; # probably in $Config{archlib}/sys/ioctl.ph
es_es: require "sys/ioctl.ph"; # probablemente en $Config{archlib}/sys/ioctl.ph

source: to get the correct function definitions.
es_es: para obtener las correctas definiciones de la función.

source: If F<sys/ioctl.ph> doesn't exist or doesn't have the correct definitions you'll have to roll your own, based on your C header files such as F<< <sys/ioctl.h> >>.
es_es: Si F<sys/ioctl.ph> no existe o no tiene las definiciones correctas, tendrá que incorporar las suyas propias, basadas en sus ficheros de cabecera C como las de F<< <sys/ioctl.h> >>.

source: (There is a Perl script called B<h2ph> that comes with the Perl kit that may help you in this, but it's nontrivial.) SCALAR will be read and/or written depending on the FUNCTION--a pointer to the string value of SCALAR will be passed as the third argument of the actual C<ioctl> call.
es_es: (Existe un script Perl llamado B<h2ph> que viene con el kit Perl que puede ayudarle en esto, pero no es nada trivial). ESCALAR será leído o escrito dependiendo de la FUNCIÓN -- un puntero al valor del string ESCALAR será pasado como tercer argumento de la actual llamada C<ioctl>.

source: (If SCALAR has no string value but does have a numeric value, that value will be passed rather than a pointer to the string value.
es_es: (Si ESCALAR no tiene un valor string sino que tiene un valor numérico, este valor será el que se pase, en lugar de un puntero al valor del string.

source: To guarantee this to be true, add a C<0> to the scalar before using it.) The C<pack> and C<unpack> functions may be needed to manipulate the values of structures used by C<ioctl>.
es_es: Para garantizar este último comportamiento, añada un C<0> al escalar antes de usarlo). Las funciones C<pack> y C<unpack> pueden ser necesarias para manipular los valores de las estructuras usadas por C<ioctl>.

source: The return value of C<ioctl> (and C<fcntl>) is as follows:
es_es: El valor devuelto de C<ioctl> (y C<fcntl>) es como sigue:

source: if OS returns: then Perl returns: -1 undefined value 0 string "0 but true" anything else that number
es_es: Si SO devuelve: entonces Perl devuelve: -1 valor indefinido 0 string "0 but true" cualquier otro ese número

source: Thus Perl returns true on success and false on failure, yet you can still easily determine the actual value returned by the operating system:
es_es: Así, Perl devuelve verdadero en éxito y falso en fallo, por lo que aún podemos determinar el valor actual devuelto por el sistema operativo:

# printf "System returned %d ", $retval;
source: printf "System returned %d\n", $retval;
es_es: printf "Sistema devolvió %d\n", $retval;

source: The special string C<"0 but true"> is exempt from B<-w> complaints about improper numeric conversions.
es_es: El string especial C<"0 but true"> es una excepción de los mensajes de aviso activados por B<-w> sobre una conversión numérica impropia.

source: =item join EXPR,LIST X<join>
es_es: =item join EXPR,LISTA X<join>

source: Joins the separate strings of LIST into a single string with fields separated by the value of EXPR, and returns that new string.
es_es: Une los strings separados de LISTA en un único string con campos separados por el valor de EXPR y devuelve el nuevo string.

source: Beware that unlike C<split>, C<join> doesn't take a pattern as its first argument.
es_es: Cuidado que, a diferencia de C<split>, C<join> no toma un patrón como su primer argumento.

source: Compare L</split>.
es_es: Compare con L</split>.

source: Returns a list consisting of all the keys of the named hash.
es_es: Devuelve una lista consistente de todas las claves del hash indicado.

source: (In scalar context, returns the number of keys.)
es_es: (En contexto escalar, devuelve el número de claves).

source: The keys are returned in an apparently random order.
es_es: Las claves son devueltas en un aparente aleatorio orden.

source: The actual random order is subject to change in future versions of perl, but it is guaranteed to be the same order as either the C<values> or C<each> function produces (given that the hash has not been modified).
es_es: El actual orden aleatorios está sujeto a cambio en futuras versiones de perl, pero se garantiza que sea el mismo orden que las funciones C<values> o C<each> producirían (dado que el hash no ha sido modificado).

source: As a side effect, calling keys() resets the HASH's internal iterator (see L</each>).
es_es: Como efecto colateral, llamando keys() resetea el iterador interno del HASH (ver L</each>).

source: In particular, calling keys() in void context resets the iterator with no other overhead.
es_es: De forma particular, llamando a keys() en contexto nulo (void) resetea el iterador sin otro efecto.

source: Here is yet another way to print your environment:
es_es: Aquí hay otra forma de imprimir su entorno:

source: or how about sorted by key:
es_es: o de forma ordenada por la clave:

source: The returned values are copies of the original keys in the hash, so modifying them will not affect the original hash.
es_es: Los valores devueltos son copias de las claves originales en el hash, así que modificarlas no afectará al hash original.

source: Compare L</values>.
es_es: Compare con L</values>.

source: To sort a hash by value, you'll need to use a C<sort> function.
es_es: Para ordenar un hash por valor, necesitará usar la función C<sort>.

source: Here's a descending numeric sort of a hash by its values:
es_es: Esto es una ordenación numérica descendente de un hash por sus valores:

source: As an lvalue C<keys> allows you to increase the number of hash buckets allocated for the given hash.
es_es: Usado como valor a la izquierda, C<keys> le permite incrementar el número de alojamientos de memoria hash para ese hash.

source: This can gain you a measure of efficiency if you know the hash is going to get big.
es_es: Puede hacerle ganar más eficiencia si sabe que el hash va a tener un gran tamaño.

source: (This is similar to pre-extending an array by assigning a larger number to $#array.) If you say
es_es: (Esto es similar a pre-extender un array asignándole un gran número a $#array). Si dice

source: then C<%hash> will have at least 200 buckets allocated for it--256 of them, in fact, since it rounds up to the next power of two.
es_es: entonces C<%hash> tendrá al menos 200 slots de memoria reservados para él -- 256 de ellos, de hecho, ya que se redondea a la siguiente potencia de dos.

source: These buckets will be retained even if you do C<%hash = ()>, use C<undef %hash> if you want to free the storage while C<%hash> is still in scope.
es_es: Estos slots serán mantenidos incluso si hace C<%hash = ()>. Use C<undef %hash> si quiere liberar el almacenamiento mientras mantiene a C<%hash> en el ámbito.

source: You can't shrink the number of buckets allocated for the hash using C<keys> in this way (but you needn't worry about doing this by accident, as trying has no effect).
es_es: No puede reducir el número de slots reservados para el hash usando C<keys> de esta manera (pero no necesita preocuparse de hacer esto por accidente; intentarlo no tiene ningún efecto).

source: See also C<each>, C<values> and C<sort>.
es_es: Ver también C<each>, C<values> y C<sort>.

source: =item kill SIGNAL, LIST X<kill> X<signal>
es_es: =item kill SEÑAL, LISTA X<kill> X<signal> X<señal>

source: Sends a signal to a list of processes.
es_es: Manda una señal a una lista de procesos.

source: Returns the number of processes successfully signaled (which is not necessarily the same as the number actually killed).
es_es: Devuelve el número de procesos señalados exitósamente (que no es necesariamente el mismo número de los llamados).

source: kill 9, @goners;
es_es: kill 9, @finalizadores;

source: If SIGNAL is zero, no signal is sent to the process.
es_es: Si SEÑAL es cero, no se envía señal al proceso.

source: This is a useful way to check that a child process is alive and hasn't changed its UID.
es_es: Esto es útil para comprobar que un proceso hijo está vivo y no ha cambiado su UID.

source: See L<perlport> for notes on the portability of this construct.
es_es: Ver L<perlport> para notas sobre portabilidad de esta construcción.

source: Unlike in the shell, if SIGNAL is negative, it kills process groups instead of processes.
es_es: A diferencia del shell, si SEÑAL es negativo , mata el grupo de procesos en lugar de procesos.

source: (On System V, a negative I<PROCESS> number will also kill process groups, but that's not portable.) That means you usually want to use positive not negative signals.
es_es: (En System V, un número de I<PROCESO> negativo también matará grupos de procesos, pero esto no es portable). Esto quiere decir que normalmente querrá usar señales positivas.

source: You may also use a signal name in quotes.
es_es: Puede usar también nombres de señales entrecomilladas.

source: See L<perlipc/"Signals"> for more details.
es_es: Ver L<perlipc/"Señales"> para más detalles.

source: =item last LABEL X<last> X<break>
es_es: =item last ETIQUETA X<last> X<break>

source: The C<last> command is like the C<break> statement in C (as used in loops); it immediately exits the loop in question.
es_es: El comando C<last> es como la sentencia C<break> del C (usada en bucles); inmediatamente sale del bucle en cuestión.

source: If the LABEL is omitted, the command refers to the innermost enclosing loop.
es_es: Si la ETIQUETA se omite, el comando se refiere al bucle más interior en que se encuentre.

source: The C<continue> block, if any, is not executed:
es_es: El bloque C<continue>, si está, no es ejecutado:

source: LINE: while (<STDIN>) { last LINE if /^$/; # exit when done with header #...
es_es: LINEA: while (<STDIN>) { last LINEA if /^$/; # salir cuando se termine la cabecera ...

source: C<last> cannot be used to exit a block which returns a value such as C<eval {}>, C<sub {}> or C<do {}>, and should not be used to exit a grep() or map() operation.
es_es: C<last> no puede usarse para salir de un bloque que devuelve un valor, como C<eval {}>, C<sub {}> o C<do {}> y no debe usarse para salir de una operación grep() o map().

source: Note that a block by itself is semantically identical to a loop that executes once.
es_es: Note que un bloque por sí mismo es semánticamente idéntico a un bucle que se ejecuta una vez.

source: Thus C<last> can be used to effect an early exit out of such a block.
es_es: Así, C<last> puede ser usado para salir prematuramente de este bloque.

source: See also L</continue> for an illustration of how C<last>, C<next>, and C<redo> work.
es_es: Ver también L</continue> para una ilustración de cómo funcionan C<last>, C<next> y C<redo>.

source: or
es_es: o

source: The C<redo> command restarts the loop block without evaluating the conditional again.
es_es: El comando C<redo> reinicia la iteración sin evaluar de nuevo la condición.

source: So don't do that.
es_es: Así que no lo haga.

source: =head1 NAME
es_es: =head1 NOMBRE

source: perlbook - Perl book information
es_es: perlbook - Información sobre libros de Perl

source: The Camel Book, officially known as I<Programming Perl, Third Edition>, by Larry Wall et al, is the definitive reference work covering nearly all of Perl.
es_es: El libro del Dromedario, oficialmente conocido como I<Programando en Perl, Tercera Edición>, de Larry Wall y otros, es la referencia definitiva sobre casi todo el lenguaje Perl.

source: You can order it and other Perl books from O'Reilly & Associates, 1-800-998-9938.
es_es: Puede pedir éste y otros libros Perl a O'Reilly & Asociados, 1-800-998-9938.

source: Local/overseas is +1 707 829 0515.
es_es: Llamada internacional +1 707 829 0515.

source: If you can locate an O'Reilly order form, you can also fax to +1 707 829 0104.
es_es: Si encuentra un formulario de pedido de O'Reilly, puede enviarlo por fax a +1 707 829 0104.

source: If you're web-connected, you can even mosey on over to L<http://www.oreilly.com/> for an online order form.
es_es: Si puede conectarse por web, puede encontrar un formulario en L<http://www.oreilly.com/>.

source: Other Perl books from various publishers and authors can be found listed in L<perlfaq2> or on the web at L<http://books.perl.org/>.
es_es: Otros libros sobre Perl de otras editoriales y autores pueden encontrarse en L<perlfaq2> o en la web L<http://books.perl.org/>.

source: =head1 NAME X<syntax>
es_es: =head1 NOMBRE X<sintaxis>

source: perlsyn - Perl syntax
es_es: perlsyn - Sintaxis Perl

source: A Perl program consists of a sequence of declarations and statements which run from the top to the bottom.
es_es: Un programa Perl consiste en una secuencia de declaraciones y sentencias que se ejecutan de arriba a abajo.

source: Loops, subroutines and other control structures allow you to jump around within the code.
es_es: Bucles, subrutinas y otras estructuras de control le permiten saltar a lo largo del código.

source: Perl is a B<free-form> language, you can format and indent it however you like.
es_es: Perl es un lenguaje de B<forma libre>, puede formatearlo y sangrarlo como quiera.

source: Whitespace mostly serves to separate tokens, unlike languages like Python where it is an important part of the syntax.
es_es: El espacio en blanco sirve para separar tokens, a diferencia de lenguajes como Python donde es una parte importante de la sintaxis.

source: Many of Perl's syntactic elements are B<optional>.
es_es: Muchos de los elementos sintácticos de Perl son B<opcionales>.
